#pragma once

#include "source2sdk/source2gen/source2gen.hpp"
#include <cstddef>
#include <cstdint>
#include "source2sdk/client/C_PointEntity.hpp"

// /////////////////////////////////////////////////////////////
// Module: client
// Created using source2gen - github.com/neverlosecc/source2gen
// /////////////////////////////////////////////////////////////

namespace source2sdk
{
    namespace client
    {
        // Registered alignment: 0x8
        // Alignment: 0x8
        // Standard-layout class: false
        // Size: 0x588
        // Has VTable
        // Construct allowed
        // MClassHasEntityLimitedDataDesc
        // MNetworkAssumeNotNetworkable
        #pragma pack(push, 1)
        class CMapInfo : public source2sdk::client::C_PointEntity
        {
        public:
            std::int32_t m_iBuyingStatus; // 0x568            
            float m_flBombRadius; // 0x56c            
            std::int32_t m_iPetPopulation; // 0x570            
            bool m_bUseNormalSpawnsForDM; // 0x574            
            bool m_bDisableAutoGeneratedDMSpawns; // 0x575            
            uint8_t _pad0576[0x2]; // 0x576
            float m_flBotMaxVisionDistance; // 0x578            
            std::int32_t m_iHostageCount; // 0x57c            
            bool m_bFadePlayerVisibilityFarZ; // 0x580            
            bool m_bRainTraceToSkyEnabled; // 0x581            
            uint8_t _pad0582[0x6];
            
            // Datamap fields:
            // int32_t InputFireWinCondition; // 0x0
        };
        #pragma pack(pop)
        
        // Cannot assert offsets of fields in CMapInfo because it is not a standard-layout class
        
        static_assert(sizeof(source2sdk::client::CMapInfo) == 0x588);
    };
};
